/*
  разбить на компоненты повторяющиеся блоки.

  создать медиа запрос для ноутбуков:
    - размер карточок с продуктами нужно сделать меньше

    рекламный блок слишком большой для екранов ноутбука


    группы
    торты муссовые
    зефир
    печенье
    конфеты
    мотти
    пасхальная выпечка

    треба придумати як зв'язати категорії товарів з массивом об'єктів продуктів
     - відповідно в адмінку треба добавити вибір категорії товару (наприклад ставити галочку біля назви категорії)
     - переаисати локал сторадж


    сделать страницу для полного описания товара

    */