/*

ВАЖНОЕ:
сделать компонент высшего порядка для слайдеров
добавить кнопку "очистить форму" для удаления всех записей на полях ввода
(нужно в юзЕффект изменять данные при добавлении в поля ввода данных)
нужно получить весь список полей ввода и отслеживать изменения их данных


- нужно на сервере при сохранении данных сначала проверять по массиву обьектов есть ли по такому номеру идентифик. продукт
- если есть тогда перезаписать новые данные 
- если нет тогда создается новый продукт

нужно поставить ограничение на:
- не допускать пустые поля ввода
- в цене только цифры (регулярные выражения)



    линк админ пароль оооочень длинний

    сделать роут на удаление и добавление рекламы на сервере

    проработать рекламу:
    - добавить в админ панель удаление и редактирование рекламы
    - продумать функцию на удаление и редактирование данных общую для всех разделов карусели
      (можно сделать с коллбеками)

    записати медіазапроси після закінчення роботи



    заполнить ссылки для кнопок соцсе

*/