/*
  разбить на компоненты повторяющиеся блоки.
    на вкладці АДМІН треба зробити список массиву товарів і щоб його можна було редагувати
    - редагувати данні (по нажатии на товар перенести данные обратно в поля ввода, но при этом данные нужно в файле заменить после сохранения вместо редактируемых)
    
    линк админ пароль оооочень длинний

    сделать роут на удаление и добавление рекламы на сервере

    проработать рекламу:
    - добавить в админ панель удаление и редактирование рекламы
    - продумать функцию на удаление и редактирование данных общую для всех разделов карусели
      (можно сделать с коллбеками)

    записати медіазапроси після закінчення роботи



    заполнить ссылки для кнопок соцсе

*/