/*
  разбить на компоненты повторяющиеся блоки.

    сделать страницу для полного описания товара

    на вкладці АДМІН треба зробити список массиву товарів і щоб його можна було редагувати
    - сделать карусель для разных разделов обслуживания
    - редагувати данні
    - добавлення реклами (так само як продукти)
    
    записати медіазапроси після закінчення роботи
    
    в картках продуктів різна висота залежить від кількості тексту

    після видалення карточки продукта треба почистити обробники події на кнопкі видалити

    
    в карточках продуктів треба опис зробити визначеною довжиною, а протім три крапки в кінці.


    сторінка детально продукція
    - посилати в пропсах данні
    -переписати  роути - зробити идентифікаційний номер продуктів в url
    - з головної сторінки посилати пропси до продукції данні з масиву продуктів

    (на майбутнє під картинкою продукта вставити наклейку знижка або акціz
    линк админ пароль оооочень длинний
    заполнить ссылки для кнопок соцсе

    кнопка назад на вкладці докладно продукт

    сделать роут на удаление и добавление продукта и рекламы на сервере

*/