/*
  разбить на компоненты повторяющиеся блоки.

  нужно узнать как работает история в роутахЖ
  - при обновлении страници "продукта" нужно подгружать данные о выбраном продукте
   (нужно при загрузке страници в useEffect сохранять данные о выбраном продукте и при повторной загрузке эти данные подставлять)(либо загружать данные с сервера с номера ID)

    на вкладці АДМІН треба зробити список массиву товарів і щоб його можна було редагувати
    - редагувати данні (по нажатии на товар перенести данные обратно в поля ввода, но при этом данные нужно в файле заменить после сохранения вместо редактируемых)
    
    (на майбутнє під картинкою продукта вставити наклейку або гифку (знижка або акція)

    линк админ пароль оооочень длинний
    заполнить ссылки для кнопок соцсе

    сделать роут на удаление и добавление рекламы на сервере


    проработать рекламу:
    - спинер убрать
    - добавить в админ панель удаление и редактирование рекламы
    - продумать функцию на удаление и редактирование данных общую для всех разделов карусели
      (можно сделать с коллбеками)

    записати медіазапроси після закінчення роботи

*/